; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite2 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	satellite3 - satellite
	instrument12 - instrument
	thermograph0 - mode
	image1 - mode
	GroundStation2 - direction
	GroundStation10 - direction
	Star9 - direction
	GroundStation8 - direction
	Star4 - direction
	GroundStation13 - direction
	Star6 - direction
	GroundStation11 - direction
	Star14 - direction
	GroundStation12 - direction
	GroundStation7 - direction
	Star1 - direction
	GroundStation5 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Planet17 - direction
	Star18 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star9)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 thermograph0)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation10)
	(supports instrument2 image1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation7)
	(calibration_target instrument2 GroundStation10)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 Star4)
	(supports instrument3 image1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation12)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument4 image1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation3)
	(calibration_target instrument4 GroundStation10)
	(supports instrument5 image1)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 Star9)
	(calibration_target instrument5 GroundStation8)
	(calibration_target instrument5 GroundStation12)
	(calibration_target instrument5 GroundStation13)
	(calibration_target instrument5 GroundStation3)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation13)
	(calibration_target instrument6 GroundStation7)
	(calibration_target instrument6 GroundStation8)
	(calibration_target instrument6 GroundStation0)
	(calibration_target instrument6 Star6)
	(supports instrument7 thermograph0)
	(supports instrument7 image1)
	(calibration_target instrument7 GroundStation13)
	(calibration_target instrument7 Star4)
	(calibration_target instrument7 GroundStation8)
	(calibration_target instrument7 GroundStation0)
	(calibration_target instrument7 Star9)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(on_board instrument7 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation10)
	(supports instrument8 image1)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 Star1)
	(calibration_target instrument8 Star6)
	(calibration_target instrument8 GroundStation7)
	(supports instrument9 thermograph0)
	(supports instrument9 image1)
	(calibration_target instrument9 GroundStation11)
	(calibration_target instrument9 Star6)
	(calibration_target instrument9 GroundStation0)
	(calibration_target instrument9 Star1)
	(supports instrument10 thermograph0)
	(supports instrument10 image1)
	(calibration_target instrument10 GroundStation0)
	(calibration_target instrument10 GroundStation12)
	(calibration_target instrument10 Star14)
	(calibration_target instrument10 Star1)
	(calibration_target instrument10 GroundStation3)
	(supports instrument11 image1)
	(supports instrument11 thermograph0)
	(calibration_target instrument11 GroundStation0)
	(calibration_target instrument11 GroundStation5)
	(calibration_target instrument11 Star1)
	(calibration_target instrument11 GroundStation7)
	(on_board instrument8 satellite2)
	(on_board instrument9 satellite2)
	(on_board instrument10 satellite2)
	(on_board instrument11 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star14)
	(supports instrument12 image1)
	(calibration_target instrument12 GroundStation3)
	(on_board instrument12 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet15)
)
(:goal (and
	(pointing satellite2 Star14)
	(have_image Planet15 image1)
	(have_image Phenomenon16 image1)
	(have_image Planet17 image1)
	(have_image Star18 thermograph0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 5
2. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 1 of 5
3. (turn_to satellite0 planet15 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet15)
   goals met: 1 of 5
4. (take_image satellite0 planet15 instrument0 image1)
   added: (have_image planet15 image1)
   goals met: 2 of 5
5. (turn_to satellite0 phenomenon16 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 phenomenon16)
   goals met: 2 of 5
6. (take_image satellite0 phenomenon16 instrument0 image1)
   added: (have_image phenomenon16 image1)
   goals met: 3 of 5
7. (turn_to satellite0 planet17 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 planet17)
   goals met: 3 of 5
8. (take_image satellite0 planet17 instrument0 image1)
   added: (have_image planet17 image1)
   goals met: 4 of 5
9. (turn_to satellite0 star18 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 star18)
   goals met: 4 of 5
10. (take_image satellite0 star18 instrument0 thermograph0)
   added: (have_image star18 thermograph0)
   goals met: 5 of 5
